{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2023-12-06T11:45:16.4544324Z","creationSource":null,"description":"Power Settings on MMWP devices","lastModifiedDateTime":"2023-12-06T11:45:16.4544324Z","name":"Windows Client Power Settings","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"f9eb4cb3-04b9-4ace-905a-f3e0a11e370c","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff_1","children":[]}}}]}