{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-17T05:19:27.2363374Z","creationSource":null,"description":"v 1.0.0","lastModifiedDateTime":"2025-07-17T05:19:27.2363374Z","name":"CONF-PRD-WIN-M-SC-AVD_Feed_Discovery","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"7c832069-51ba-4e2b-a233-97c1ecce88a9","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_admx_terminalserver_ts_radc_defaultconnection","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_admx_terminalserver_ts_radc_defaultconnection_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_admx_terminalserver_ts_radc_defaultconnection_ts_radc_defaultconnectionurl","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"https://rdweb.wvd.microsoft.com/api/arm/feeddiscovery"}}]}}}]}